Завдання 7: Порівнюємо отримані за допомогою методу Монте-Карло результати з аналітичними розрахунками, наведеними в таблиці нижче:
  

Сума	Ймовірність (Монте-Карло) Аналітична ймовірність	
2	        2.777%                      2.78%	
3	5.529%                      5.56%
4	        8.334%                      8.33%	
5	        11.096%                     11.11%	
6	        13.868%                     13.89%	
7	        16.698%                     16.67%	
8	        13.886%                     13.89%	
9	        11.110%                     11.11%	
10	        8.346%                      8.33%	
11	        5.568%                      5.56%	
12	        2.790%                      2.78%	

Як видно з таблиці, результати симуляції виявляються дуже близькими до аналітичних значень. 
Це демонструє ефективність методу Монте-Карло для оцінки ймовірностей у задачах, де аналітичні значення можуть бути визначені. 

